In [122]:
# db 복원 
# mysql -uroot [db명] < ~/backup.sql

In [123]:
# 1) 일별 매출액 조회 
# SELECT *
# FROM ORDERS A 
# SELECT A.orderDate,B.priceEach* B.quantityOrdered AS RESULT
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber

# 날짜별합계
# SELECT A.orderDate,SUM(B.priceEach* B.quantityOrdered) AS SALES
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY A.orderDate

# SELECT A.orderDate, B.priceEach * B.quantityOrdered
# FROM orders A
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber;

# SELECT orders.orderDate, orderdetails.priceEach * orderdetails.quantityOrdered
# FROM orders 
# LEFT JOIN orderdetails 
# ON orders.orderNumber = orderdetails.orderNumber;

# SELECT A.orderDate, B.priceEach * B.quantityOrdered AS RESULT
# FROM orders A
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber;

# SELECT A.orderDate, SUM(B.priceEach * B.quantityOrdered) AS SALES
# FROM orders A
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY A.orderDate;

# SELECT A.orderDate, SUM(B.priceEach * B.quantityOrdered) AS SALES
# FROM orders A
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY 1

# SALES 내림차순으로 정렬
# SELECT A.orderDate,SUM(B.priceEach* B.quantityOrdered) AS SALES
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY 1
# ORDER BY 2 DESC

# SELECT SUBSTR('ABCDEF',2,3)
# 배열INDEX 1부터 시작

In [124]:
# 월별 매출 합계 구하기
 # -> 정렬은 날짜순으로....
# SELECT SUBSTR(A.orderDate,1,7)  ,SUM(B.priceEach* B.quantityOrdered) AS SALES
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY 1
# ORDER BY 1

In [125]:
# 건당 구매 금액(ATV, Average Transaction Value) 
# 매출 / 구매 건수 ->ATV
# 건당 구매 금액(ATV, Average Transaction Value) 
# https://blog.naver.com/PostView.nhn?blogId=insidecompany&logNo=222030886283&parentCategoryNo=&categoryNo=24&viewDate=&isShowPopularPosts=true&from=search
# Q : 1건의 거래는 평균적으로 얼마의 매출을 발생시키는가? 
# YY , cnt_purchaser, sales, atv

# MY 
# SELECT SUBSTR(A.orderDate,1,4) AS YY , COUNT(*) AS cnt_purchaser, SUM(B.priceEach* B.quantityOrdered) AS SALES , SUM(B.priceEach* B.quantityOrdered)/COUNT(*) AS ATV
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY 1

# PROFESSOR
# SELECT SUBSTR(A.orderDate,1,4) AS YY , COUNT(DISTINCT (A.orderNumber)) AS cnt_purchaser, SUM(B.priceEach* B.quantityOrdered) AS SALES , SUM(B.priceEach* B.quantityOrdered)/COUNT(*) AS ATV
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# GROUP BY 1

SyntaxError: invalid syntax (3091577148.py, line 3)

In [ ]:
# 국가별, 도시별 매출액 
# SELECT C.country, C.city, SUM(B.priceEach* B.quantityOrdered) AS SALES
# FROM orders A 
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# LEFT JOIN customers C
# ON A.customerNumber=C.customerNumber 
# GROUP BY C.country, C.city
# ORDER BY 1

In [ ]:
import sqlalchemy
from urllib import parse
import pandas as pd
user = 'id'
password = 'pw'
host='ip'
port = port
database = 'classicmodels'
password = parse.quote_plus(password)
engine = sqlalchemy.create_engine(f"mysql://{user}:{password}@{host}:{port}/{database}")

In [ ]:
order = pd.read_sql_query("select * from orders", con=engine)
orderdetails = pd.read_sql_query("select * from orderdetails", con=engine)
customers = pd.read_sql_query("select * from customers", con=engine)

In [ ]:
pd_rt1 = pd.merge(order, orderdetails, on=['orderNumber'], how='left')

In [ ]:
df = pd.merge(pd_rt1, customers, on=['customerNumber'],how='left')
# df = pd.merge(pd.merge(order, orderdetails, on='orderNumber', how='left'), customers, on="customerNumber", how='left')

In [ ]:
df['tmp']=df['priceEach']*df['quantityOrdered']

In [ ]:
df2 = df.groupby(['country','city'],as_index=False)[['tmp']].sum().sort_values(by=['country','city']).rename(columns={"tmp":"atv"})

In [ ]:

df2 = df.groupby(['country', 'city'],as_index=False)[['tmp']].sum().sort_values(by=['country', \
                                        'city']).rename(columns={'tmp' : 'sales'})

In [ ]:
df2['rank'] = df2['sales'].rank(method="min",ascending=False)

In [ ]:
df2

In [ ]:
df2.sort_values(by=['sales'],ascending=False)

In [ ]:
# CASE WHEN 조건 THEN 결과
# SELECT CASE WHEN COUNTRY IN ("Cnada","USA") THEN 'North America' 
# ELSE 'Others'  END COUNTRY_GRP
# FROM customers 

# DENSE_RANK() 1 1 2 2 3
# RANK() 1 1 3 3 5

In [ ]:
# SELECT COUNT(*) FROM
# (SELECT C.country, C.city, 
# SUM(B.priceEach * B.quantityOrdered) AS sales
# FROM orders A
# LEFT JOIN orderdetails B
# ON A.orderNumber = B.orderNumber
# LEFT JOIN customers C
# ON A.customerNumber = C.customerNumber
# GROUP BY 1, 2 
# ORDER BY 1) D

# 괄호로 감싸주고 무조건 이름있어야한다

In [ ]:
pwd

In [ ]:
data = pd.read_csv("./dataset2.csv",delimiter=";")

In [ ]:
data.shape

In [ ]:
display(data.head(1))
print(data.columns)

In [ ]:
for x in data.columns:
    print(f"`{x}`")

In [ ]:
# user = 'id'
# password = 'pw'
# host='ip'
# port = port
# database = 'classicmodels'
# password = parse.quote_plus(password)

In [ ]:
import pymysql
con =pymysql.connect(host='ip', user='id', password='pw', db='classicmodels', charset='utf8')
cur = con.cursor()

In [ ]:
cur.execute("show tables")

In [ ]:
for x in cur.fetchall(): #한번보여주고 메모리 날림 
    print(x[0])

In [ ]:
cur.execute(sql)

In [ ]:
con.commit()

In [ ]:
sql= """CREATE Table dataset2
(
    `Clothing ID` INT,
    `Age` INT,
    `Title` VARCHAR(30),
    `Review Text` TEXT,
    `Rating` INT,
    `Recommended IND` INT,
    `Positive Feedback Count`INT,
    `Division Name` VARCHAR(30),
    `Department Name` VARCHAR(30),
    `Class Name` VARCHAR(30)
)"""

In [ ]:
def tmp(x):
    global var_x 
    var_x = x
    cur.execute("INSERT  INTO dataset2 VALUES (%s, %s, %s, %s, %s,%s, %s, %s, %s, %s)", x.tolist())
    return 0

In [ ]:
data=  data.where(pd.notnull(data), None)

In [126]:
data.head(1)

,Clothing ID,Age,Title,Review Text,Rating,Recommended IND,Positive Feedback Count,Division Name,Department Name,Class Name
0,767,33,None,Absolutely wonderful - silky and sexy and comf...,4,1,0,Initmates,Intimate,Intimates

In [127]:
# data.iloc[

In [128]:
data.apply(tmp,axis=1)

0        0
1        0
2        0
3        0
4        0
        ..
20598    0
20599    0
20600    0
20601    0
20602    0
Length: 20603, dtype: int64

In [129]:
con.commit()

In [130]:
data.shape

(20603, 10)

In [131]:
cur.execute("select count(*) from dataset2")

1

In [132]:
cur.fetchall()

((41206,),)

In [133]:
cur.execute("truncate table dataset2")

0

In [134]:
con.commit() #heide autocommit 파이썬은 autocommit x

In [135]:
def tmp(x):
    global var_x 
    var_x = x
    cur.execute("INSERT  INTO dataset2 VALUES (%s, %s, %s, %s, %s,%s, %s, %s, %s, %s)", x.tolist())
    return 0

In [136]:
insert_sql="INSERT  INTO dataset2 VALUES (%s, %s, %s, %s, %s,%s, %s, %s, %s, %s)"

In [137]:
data.apply(lambda x : cur.execute(insert_sql,x.tolist()),axis=1)

0        1
1        1
2        1
3        1
4        1
        ..
20598    1
20599    1
20600    1
20601    1
20602    1
Length: 20603, dtype: int64

In [138]:
con.commit()

In [139]:
con.rollback() #commit하기전에는 기회가있지만 commit하면 되돌릴수없다

In [140]:
# • Clothing ID: 상품 번호(Unique Value) 
# • Age: 리뷰작성자의 연령 
# • Title: 리뷰 제목 
# • ReviewText: 리뷰내용 
# • Rating: 리뷰 작성자가 제출한 평점 
# • Recommended IND: 리뷰어에 의한 상품 추천 여부 
# • Positive Feedback Count: 긍정 적 피드백 수 
# • Division Name: 상품이 속한 Division 
# • Department Name: 상품이 속한 Department 
# • Class Name: 상품의 타입

#Division name별 평균 평점

In [ ]:
# SELECT `Division Name` , AVG(Rating) AS AVG_RATE
# FROM dataset2
# GROUP BY `Division Name`
# ORDER BY 2

In [141]:
type(data)

pandas.core.frame.DataFrame

In [148]:
data.groupby(['Division Name'],as_index=False)[['Rating']].mean().sort_values(by=['Rating'],ascending=False).rename(columns={"Rating" : "avg_rate"})

    Division Name  avg_rate
2       Initmates  4.294985
1  General Petite  4.208867
0         General  4.172644

In [156]:
def tmp(x):
    if x<20:
        return "청소년"
    elif x<50:
        return "청년"
    else:
        return "중년"

In [157]:
data["Age"].apply(tmp)

0        청년
1        청년
2        중년
3        중년
4        청년
         ..
20598    청년
20599    청년
20600    청년
20601    청년
20602    중년
Name: Age, Length: 20603, dtype: object

In [160]:
data["age_class"] = data["Age"].apply(lambda x : '청소년' if x<20 else ("청년" if x<50 else "중년" ) )

In [161]:
data['age_class'].value_counts()

age_class
청년     14730
중년      5833
청소년       40
Name: count, dtype: int64

In [158]:
# for i in range(len(data)):
#     age_temp=data.loc[i,"Age"]
#     if age_temp<20:
#         data.loc[i,"age_class"]="청년"
#     elsif 
#     # print(data.loc[i,'Age'])
#     # break;

In [150]:
data['age_div']= 

for i in range():
    if data[i] 
# 20살 미만 청년 20~40 중년 40이상은 노년

    Age    Rating
0    18  4.666667
1    19  4.162162
2    20  4.432990
3    21  4.432990
4    22  4.488189
..  ...       ...
72   91  2.750000
73   92  5.000000
74   93  4.500000
75   94  3.333333
76   99  4.500000

[77 rows x 2 columns]

In [ ]:
SELECT CASE WHEN AGE BETWEEN 0 AND 19 THEN "청소년"
WHEN AGE BETWEEN 20 AND 49 THEN "청년"
WHEN AGE BETWEEN 49 AND 99 THEN "중년" END age_class
from dataset2

In [ ]:
 # git pull origin master